# -*- coding: utf-8 -*-
import tensorflow as tf
#########################################################################################
#                                                                                       
#                                1.构建图                                                
#                                                                                         
#########################################################################################

#创建一个常量op，产生一个1*2矩阵，这个op被称作一个节点，并加入到默认图中。
matrix1 = tf.constant([[3.,3.]])

#创建一个常量op，产生一个2*1矩阵。
matrix2 = tf.constant([[2.],[2.]])

#创建一个矩阵乘法matmul op，其输入是'matrix1',其返回值product是矩阵乘法的输出结果
product = tf.matmul(matrix1,matrix2)

#########################################################################################
#                                                                                       
#                                2.在一个Session中启动图                                                
#                                                                                         
#########################################################################################

#非with形式
with tf.Session() as sess:
    result = sess.run([product])
    print result